app/controllers/books_controller.rb

SELECT * FROM "books" WHERE (isAvailable LIKE 1)
---
  def index
    @books = Book.all

SELECT * FROM "books" WHERE ("books"."id" = 1)
SELECT * FROM "books" WHERE ("books"."user_id" IS NULL) LIMIT 1
---
  def show
    @book = Book.find(params[:id])
    @books = Book.find_by_user_id(params[:user])