app/controllers/books_controller.rb

SELECT * FROM "books" WHERE ("books"."id" = 1)
---
  def edit
    @book = Book.find(params[:id])