app/controllers/home_controller.rb

  def index
    @user = User.find_or_create_by_name(params[:user])
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES(NULL, '2011-09-20 06:28:21', '2011-09-20 06:28:21')
SELECT * FROM "users" WHERE ("users"."name" IS NULL) LIMIT 1