app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."name" IS NULL) LIMIT 1
SELECT * FROM "books" WHERE ("books"."user_id" IS NULL) LIMIT 1
---
  def index
     @users=User.find_by_name(params[:user])
     @books=Book.find_by_user_id(@users)